app/Controllers/AdmGambutRencana.php

SELECT *
FROM "tb_rencana"
---
    public function index()
    {
        $doc = $this->GambRencanaModel->findAll();