app/Controllers/AdmGambutSasaran.php

    public function index($idrencana)
    {

        $db = \Config\Database::connect();
        $data = $db->table('tb_rencana');
        $data->select('tb_rencana.kode_rencana as koderencana, tb_rencana.id as idrencana,tb_rencana.judul,
        tb_target.id, tb_target.kode_target, tb_target.volume, tb_target.satuan, tb_target.kode_khg');
        $data->join('tb_target', 'tb_target.kode_rencana = tb_rencana.kode_rencana');
        $data->where('tb_rencana.id', $idrencana);
        $query = $data->get();

        $db = \Config\Database::connect();
        $data = $db->table('tb_rencana');
        $data->select('tb_rencana.kode_rencana as koderencana, tb_rencana.id as idrencana,tb_rencana.judul');
        $data->where('tb_rencana.id', $idrencana);
        $query2 = $data->get();


        $sasaran = $query->getResultArray();
        $doc2 = $query2->getResultArray();
        // dd($sasaran);

        $doc = $this->GambRencanaModel->findAll();
        $khg = $this->GambKhgModel->findAll();
---
SELECT "tb_rencana"."kode_rencana" as "koderencana", "tb_rencana"."id" as "idrencana", "tb_rencana"."judul"
FROM "tb_rencana"
WHERE "tb_rencana"."id" = '13'
SELECT "tb_rencana"."kode_rencana" as "koderencana", "tb_rencana"."id" as "idrencana", "tb_rencana"."judul"
FROM "tb_rencana"
WHERE "tb_rencana"."id" = '12'
SELECT *
FROM "tb_rencana"
SELECT *
FROM "tb_khg"

    public function hapus_sasaran($idrencana, $id)
    {
        $this->GambTargetModel->delete($id);
---
DELETE FROM "tb_target"
WHERE "id" IN ('93')