app/Controllers/AdmGambutSasaran.php

SELECT "tb_rencana"."kode_rencana" as "koderencana", "tb_rencana"."id" as "idrencana", "tb_rencana"."judul", "tb_target"."id", "tb_target"."kode_target", "tb_target"."volume", "tb_target"."satuan", "tb_target"."deskripsi"
FROM "tb_rencana"
JOIN "tb_target" ON "tb_target"."kode_rencana" = "tb_rencana"."kode_rencana"
WHERE "tb_rencana"."id" = '13'
---
    public function index($idrencana)
    {

        $db = \Config\Database::connect();
        $data = $db->table('tb_rencana');
        $data->select('tb_rencana.kode_rencana as koderencana, tb_rencana.id as idrencana,tb_rencana.judul, tb_target.id, tb_target.kode_target, tb_target.volume, tb_target.satuan, tb_target.deskripsi');
        $data->join('tb_target', 'tb_target.kode_rencana = tb_rencana.kode_rencana');
        $data->where('tb_rencana.id', $idrencana);
        $query = $data->get();