app/Controllers/DataGrafik.php

SELECT "tb_prov"."kode_prov" as "kodeprov", "tb_prov"."nama_prov", COUNT(DISTINCT tb_khg.id) as total_khg, COUNT(DISTINCT tb_sub_khg.id) as total_sub_khg, COUNT(DISTINCT tb_hru.id) as total_hru
FROM "tb_prov"
LEFT JOIN "tb_khg" ON "tb_khg"."kode_prov" = "tb_prov"."kode_prov"
LEFT JOIN "tb_sub_khg" ON "tb_sub_khg"."kode_khg" = "tb_khg"."kode_khg"
LEFT JOIN "tb_hru" ON "tb_hru"."kode_sub_khg" = "tb_sub_khg"."kode_sub_khg"
GROUP BY "tb_prov"."kode_prov", "tb_prov"."nama_prov"
SELECT SUM(luas) as total_luas
FROM "tb_hru"
SELECT SUM(luas) as total_luas
FROM "tb_khg"
---
    public function grafikgambut()
    {
        $db = \Config\Database::connect();
        $data = $db->table('tb_prov');
        $data->select('
            tb_prov.kode_prov as kodeprov, tb_prov.nama_prov,
            COUNT(DISTINCT tb_khg.id) as total_khg,
            COUNT(DISTINCT tb_sub_khg.id) as total_sub_khg,
            COUNT(DISTINCT tb_hru.id) as total_hru
        ');
        $data->join('tb_khg', 'tb_khg.kode_prov = tb_prov.kode_prov', 'left');
        $data->join('tb_sub_khg', 'tb_sub_khg.kode_khg = tb_khg.kode_khg', 'left');
        $data->join('tb_hru', 'tb_hru.kode_sub_khg = tb_sub_khg.kode_sub_khg', 'left');
        $data->groupBy('tb_prov.kode_prov, tb_prov.nama_prov');
        $query = $data->get();

        $kawasan = $query->getResultArray();

        $kodeprov = array_column($kawasan, 'nama_prov');
        $khg = array_column($kawasan, 'total_khg');
        $subkhg = array_column($kawasan, 'total_sub_khg');
        $hru = array_column($kawasan, 'total_hru');
        // dd($kodeprov);
        $db = \Config\Database::connect();
        $data = $db->table('tb_hru');
        $data->select('SUM(luas) as total_luas');
        $query = $data->get();

SELECT "tb_prov"."kode_prov" as "kodeprov", "tb_prov"."nama_prov", SUM(tb_khg.luas) as total_khg_luas
FROM "tb_prov"
LEFT JOIN "tb_khg" ON "tb_khg"."kode_prov" = "tb_prov"."kode_prov"
GROUP BY "tb_prov"."kode_prov", "tb_prov"."nama_prov"
---
        ');
        $data->join('tb_khg', 'tb_khg.kode_prov = tb_prov.kode_prov', 'left');
        $data->groupBy('tb_prov.kode_prov, tb_prov.nama_prov');
        $query = $data->get();

SELECT "kode_prov", "nama_prov"
FROM "tb_prov"
---

        $db = \Config\Database::connect();
        // Dapatkan semua data provinsi
        $categoriesQuery = $db->table('tb_prov')
            ->select('kode_prov, nama_prov')
            ->get();

SELECT COUNT(*) as jumlah
FROM "tb_kabkot"
WHERE "kode_prov" = '15'
SELECT COUNT(*) as jumlah
FROM "tb_kec"
LEFT JOIN "tb_kabkot" ON "tb_kabkot"."kode_kabkot" = "tb_kec"."kode_kabkot"
LEFT JOIN "tb_prov" ON "tb_prov"."kode_prov" = "tb_kabkot"."kode_prov"
WHERE "tb_prov"."kode_prov" = '15'
SELECT COUNT(*) as jumlah
FROM "tb_desa"
LEFT JOIN "tb_kec" ON "tb_kec"."kode_kec" = "tb_desa"."kode_kec"
LEFT JOIN "tb_kabkot" ON "tb_kabkot"."kode_kabkot" = "tb_kec"."kode_kabkot"
LEFT JOIN "tb_prov" ON "tb_prov"."kode_prov" = "tb_kabkot"."kode_prov"
WHERE "tb_prov"."kode_prov" = '15'
---
            $kode_prov = $category['kode_prov'];

            // Query untuk mendapatkan jumlah data di tb_kabkot
            $kabkotQuery = $db->table('tb_kabkot')
                ->select('COUNT(*) as jumlah')
                ->where('kode_prov', $kode_prov)
                ->get();
            $kabkot = $kabkotQuery->getRowArray()['jumlah'];

            // Query untuk mendapatkan jumlah data di tb_kec
            $kecQuery = $db->table('tb_kec')
                ->select('COUNT(*) as jumlah')
                ->join('tb_kabkot', 'tb_kabkot.kode_kabkot = tb_kec.kode_kabkot', 'left')
                ->join('tb_prov', 'tb_prov.kode_prov = tb_kabkot.kode_prov', 'left')
                ->where('tb_prov.kode_prov', $kode_prov)
                ->get();
            $kec = $kecQuery->getRowArray()['jumlah'];

            // Query untuk mendapatkan jumlah data di tb_desa
            $desaQuery = $db->table('tb_desa')
                ->select('COUNT(*) as jumlah')
                ->join('tb_kec', 'tb_kec.kode_kec = tb_desa.kode_kec', 'left')
                ->join('tb_kabkot', 'tb_kabkot.kode_kabkot = tb_kec.kode_kabkot', 'left')
                ->join('tb_prov', 'tb_prov.kode_prov = tb_kabkot.kode_prov', 'left')
                ->where('tb_prov.kode_prov', $kode_prov)
                ->get();