app/Controllers/Home.php

SELECT * FROM (SELECT COUNT(*) as total
FROM "tb_alokasi") "uwrp0"
UNION SELECT * FROM (SELECT COUNT(*) as total FROM "tb_desa") "uwrp1"

UNION SELECT * FROM (SELECT COUNT(*) as total FROM "tb_hru") "uwrp2"

UNION SELECT * FROM (SELECT COUNT(*) as total FROM "tb_kabkot") "uwrp3"

UNION SELECT * FROM (SELECT COUNT(*) as total FROM "tb_kec") "uwrp4"

UNION SELECT * FROM (SELECT COUNT(*) as total FROM "tb_khg") "uwrp5"

UNION SELECT * FROM (SELECT COUNT(*) as total FROM "tb_lemdes") "uwrp6"

UNION SELECT * FROM (SELECT COUNT(*) as total FROM "tb_output_target") "uwrp7"

UNION SELECT * FROM (SELECT COUNT(*) as total FROM "tb_outcome_target") "uwrp8"

UNION SELECT * FROM (SELECT COUNT(*) as total FROM "tb_pelaksana") "uwrp9"

UNION SELECT * FROM (SELECT COUNT(*) as total FROM "tb_prov") "uwrp10"

UNION SELECT * FROM (SELECT COUNT(*) as total FROM "tb_rencana") "uwrp11"

UNION SELECT * FROM (SELECT COUNT(*) as total FROM "tb_rencana_kegiatan") "uwrp12"

UNION SELECT * FROM (SELECT COUNT(*) as total FROM "tb_sub_khg") "uwrp13"

UNION SELECT * FROM (SELECT COUNT(*) as total FROM "tb_sub_tindakan_restorasi") "uwrp14"

UNION SELECT * FROM (SELECT COUNT(*) as total FROM "tb_target") "uwrp15"

UNION SELECT * FROM (SELECT COUNT(*) as total FROM "tb_tindakan_restorasi") "uwrp16"
SELECT SUM(tb_alokasi.volume) as total_volume
FROM "tb_alokasi"
---
        $db = \Config\Database::connect();
        $data = $db->table('tb_alokasi');
        $data->select('SUM(tb_alokasi.volume) as total_volume');
        $query1 = $data->get();

SELECT SUM(tb_target.volume) as total_volume
FROM "tb_target"
---
        $db = \Config\Database::connect();
        $data = $db->table('tb_target');
        $data->select('SUM(tb_target.volume) as total_volume');
        $query1 = $data->get();

SELECT COUNT(tb_alokasi.id) as count_alokasi
FROM "tb_alokasi"
---
        $data->select('COUNT(tb_alokasi.id) as count_alokasi');
        $query1 = $data->get();
        $count = $query1->getRow(); // Menggunakan getRow() karena mengambil satu baris data
        $countalokasi = $count->count_alokasi;