app/Controllers/UserGambutKabkot.php

    public function index($idkabkot)
    {
        $db = \Config\Database::connect();
        $data = $db->table('tb_prov');
        $data->select('tb_prov.kode_prov as kodeprov, tb_prov.id as idprov, tb_prov.nama_prov, tb_kabkot.id as idkabkot, tb_kabkot.kode_kabkot as kodekabkot, tb_kabkot.nama_kabkot,
                        tb_kec.id, tb_kec.kode_kec, tb_kec.nama_kec, tb_kec.kode_kabkot
        ');
        $data->join('tb_kabkot', 'tb_kabkot.kode_prov = tb_prov.kode_prov');
        $data->join('tb_kec', 'tb_kec.kode_kabkot = tb_kabkot.kode_kabkot');
        $data->where('tb_kabkot.id', $idkabkot);
        $query = $data->get();

        $db = \Config\Database::connect();
        $data = $db->table('tb_prov');
        $data->select('tb_prov.kode_prov as kodeprov, tb_prov.id as idprov, tb_prov.nama_prov, tb_kabkot.id as idkabkot, tb_kabkot.kode_kabkot as kodekabkot, tb_kabkot.nama_kabkot,
        ');
        $data->join('tb_kabkot', 'tb_kabkot.kode_prov = tb_prov.kode_prov');
        $data->where('tb_kabkot.id', $idkabkot);
        $query2 = $data->get();


        $kec = $query->getResultArray();
        $kabkot2 = $query2->getResultArray();
        // dd($kabkot2);

        $kabkot = $this->GambKabkotModel->findAll();
---
SELECT "tb_prov"."kode_prov" as "kodeprov", "tb_prov"."id" as "idprov", "tb_prov"."nama_prov", "tb_kabkot"."id" as "idkabkot", "tb_kabkot"."kode_kabkot" as "kodekabkot", "tb_kabkot"."nama_kabkot", "tb_kec"."id", "tb_kec"."kode_kec", "tb_kec"."nama_kec", "tb_kec"."kode_kabkot"
FROM "tb_prov"
JOIN "tb_kabkot" ON "tb_kabkot"."kode_prov" = "tb_prov"."kode_prov"
JOIN "tb_kec" ON "tb_kec"."kode_kabkot" = "tb_kabkot"."kode_kabkot"
WHERE "tb_kabkot"."id" = '209'
SELECT "tb_prov"."kode_prov" as "kodeprov", "tb_prov"."id" as "idprov", "tb_prov"."nama_prov", "tb_kabkot"."id" as "idkabkot", "tb_kabkot"."kode_kabkot" as "kodekabkot", "tb_kabkot"."nama_kabkot"
FROM "tb_prov"
JOIN "tb_kabkot" ON "tb_kabkot"."kode_prov" = "tb_prov"."kode_prov"
WHERE "tb_kabkot"."id" = '209'
SELECT *
FROM "tb_kabkot"