app/Controllers/UserGambutProv.php

    public function index($idprov)
    {
        $db = \Config\Database::connect();
        $data = $db->table('tb_prov');
        $data->select('tb_prov.kode_prov as kodeprov, tb_prov.id as idprov,tb_prov.nama_prov, tb_kabkot.id, tb_kabkot.kode_kabkot, tb_kabkot.nama_kabkot');
        $data->join('tb_kabkot', 'tb_kabkot.kode_prov = tb_prov.kode_prov');
        $data->where('tb_prov.id', $idprov);
        $query = $data->get();

        $db = \Config\Database::connect();
        $data = $db->table('tb_prov');
        $data->select('tb_prov.kode_prov as kodeprov, tb_prov.id as idprov,tb_prov.nama_prov');
        $data->where('tb_prov.id', $idprov);
        $query2 = $data->get();


        $kabkot = $query->getResultArray();
        $prov2 = $query2->getResultArray();
        // dd($kabkot);

        $prov = $this->GambProvModel->findAll();
---
SELECT "tb_prov"."kode_prov" as "kodeprov", "tb_prov"."id" as "idprov", "tb_prov"."nama_prov", "tb_kabkot"."id", "tb_kabkot"."kode_kabkot", "tb_kabkot"."nama_kabkot"
FROM "tb_prov"
JOIN "tb_kabkot" ON "tb_kabkot"."kode_prov" = "tb_prov"."kode_prov"
WHERE "tb_prov"."id" = '80'
SELECT "tb_prov"."kode_prov" as "kodeprov", "tb_prov"."id" as "idprov", "tb_prov"."nama_prov"
FROM "tb_prov"
WHERE "tb_prov"."id" = '80'
SELECT *
FROM "tb_prov"