app/Controllers/UserGambutKegiatan.php

SELECT "tb_rencana"."kode_rencana" as "koderencana", "tb_rencana"."id" as "idrencana", "tb_rencana"."judul", "tb_rencana_kegiatan"."id", "tb_rencana_kegiatan"."kode_rencana", "tb_rencana_kegiatan"."kode_sub_tindakan_restorasi", "tb_rencana_kegiatan"."kode_rencana_kegiatan"
FROM "tb_rencana"
JOIN "tb_rencana_kegiatan" ON "tb_rencana_kegiatan"."kode_rencana" = "tb_rencana"."kode_rencana"
WHERE "tb_rencana"."id" = '17'
SELECT "tb_rencana"."kode_rencana" as "koderencana", "tb_rencana"."id" as "idrencana", "tb_rencana"."judul"
FROM "tb_rencana"
WHERE "tb_rencana"."id" = '17'
SELECT *
FROM "tb_rencana"
---
    public function index($idrencana)
    {

        $db = \Config\Database::connect();
        $data = $db->table('tb_rencana');
        $data->select('tb_rencana.kode_rencana as koderencana, tb_rencana.id as idrencana,tb_rencana.judul,
                    tb_rencana_kegiatan.id, tb_rencana_kegiatan.kode_rencana, tb_rencana_kegiatan.kode_sub_tindakan_restorasi, tb_rencana_kegiatan.kode_rencana_kegiatan
                    ');
        $data->join('tb_rencana_kegiatan', 'tb_rencana_kegiatan.kode_rencana = tb_rencana.kode_rencana');
        $data->where('tb_rencana.id', $idrencana);
        $query = $data->get();

        $db = \Config\Database::connect();
        $data = $db->table('tb_rencana');
        $data->select('tb_rencana.kode_rencana as koderencana, tb_rencana.id as idrencana,tb_rencana.judul,');
        $data->where('tb_rencana.id', $idrencana);
        $query2 = $data->get();

        $kegiatan = $query->getResultArray();
        $doc2 = $query2->getResultArray();
        // dd($kegiatan);

        $doc = $this->GambRencanaModel->findAll();