app/Controllers/UserGambutRencana.php

    public function index()
    {
        $doc = $this->GambRencanaModel->findAll();
---
SELECT *
FROM "tb_rencana"