app/Controllers/UserGambutPelaksana.php

SELECT "tb_prov"."kode_prov" as "kodeprov", "tb_prov"."id" as "idprov", "tb_prov"."nama_prov", "tb_pelaksana"."id", "tb_pelaksana"."kode_pelaksana", "tb_pelaksana"."nama", "tb_pelaksana"."jenis", "tb_pelaksana"."pj", "tb_pelaksana"."tlpn", "tb_pelaksana"."alamat", "tb_pelaksana"."kode_prov"
FROM "tb_prov"
JOIN "tb_pelaksana" ON "tb_pelaksana"."kode_prov" = "tb_prov"."kode_prov"
WHERE "tb_prov"."id" = '73'
SELECT "tb_prov"."kode_prov" as "kodeprov", "tb_prov"."id" as "idprov", "tb_prov"."nama_prov"
FROM "tb_prov"
WHERE "tb_prov"."id" = '73'
SELECT *
FROM "tb_prov"
---
    public function index($idprov)
    {
        $db = \Config\Database::connect();
        $data = $db->table('tb_prov');
        $data->select('tb_prov.kode_prov as kodeprov, tb_prov.id as idprov,tb_prov.nama_prov, tb_pelaksana.id, tb_pelaksana.kode_pelaksana, tb_pelaksana.nama, tb_pelaksana.jenis, tb_pelaksana.pj, tb_pelaksana.tlpn, tb_pelaksana.alamat, tb_pelaksana.kode_prov');
        $data->join('tb_pelaksana', 'tb_pelaksana.kode_prov = tb_prov.kode_prov');
        $data->where('tb_prov.id', $idprov);
        $query = $data->get();

        $db = \Config\Database::connect();
        $data = $db->table('tb_prov');
        $data->select('tb_prov.kode_prov as kodeprov, tb_prov.id as idprov,tb_prov.nama_prov');
        $data->where('tb_prov.id', $idprov);
        $query2 = $data->get();


        $pelaksana = $query->getResultArray();
        $prov2 = $query2->getResultArray();
        // dd($pelaksana);

        $prov = $this->GambProvModel->findAll();