app/Controllers/UserGambutKec.php

    public function index($idkec)
    {
        $db = \Config\Database::connect();
        $data = $db->table('tb_prov');
        $data->select('tb_prov.kode_prov as kodeprov, tb_prov.id as idprov, tb_prov.nama_prov,
                        tb_kabkot.id as idkabkot, tb_kabkot.kode_kabkot as kodekabkot, tb_kabkot.nama_kabkot,
                        tb_kec.id as idkec, tb_kec.kode_kec as kodekec, tb_kec.nama_kec, tb_kec.kode_kabkot,
                        tb_desa.id, tb_desa.kode_desa, tb_desa.nama_desa, tb_desa.kode_kec,
        ');
        $data->join('tb_kabkot', 'tb_kabkot.kode_prov = tb_prov.kode_prov');
        $data->join('tb_kec', 'tb_kec.kode_kabkot = tb_kabkot.kode_kabkot');
        $data->join('tb_desa', 'tb_desa.kode_kec = tb_kec.kode_kec');
        $data->where('tb_kec.id', $idkec);
        $query = $data->get();

        $db = \Config\Database::connect();
        $data = $db->table('tb_prov');
        $data->select('tb_prov.kode_prov as kodeprov, tb_prov.id as idprov, tb_prov.nama_prov,
                        tb_kabkot.id as idkabkot, tb_kabkot.kode_kabkot as kodekabkot, tb_kabkot.nama_kabkot,
                        tb_kec.id as idkec, tb_kec.kode_kec as kodekec, tb_kec.nama_kec, tb_kec.kode_kabkot
        ');
        $data->join('tb_kabkot', 'tb_kabkot.kode_prov = tb_prov.kode_prov');
        $data->join('tb_kec', 'tb_kec.kode_kabkot = tb_kabkot.kode_kabkot');
        $data->where('tb_kec.id', $idkec);
        $query2 = $data->get();
---
SELECT "tb_prov"."kode_prov" as "kodeprov", "tb_prov"."id" as "idprov", "tb_prov"."nama_prov", "tb_kabkot"."id" as "idkabkot", "tb_kabkot"."kode_kabkot" as "kodekabkot", "tb_kabkot"."nama_kabkot", "tb_kec"."id" as "idkec", "tb_kec"."kode_kec" as "kodekec", "tb_kec"."nama_kec", "tb_kec"."kode_kabkot"
FROM "tb_prov"
JOIN "tb_kabkot" ON "tb_kabkot"."kode_prov" = "tb_prov"."kode_prov"
JOIN "tb_kec" ON "tb_kec"."kode_kabkot" = "tb_kabkot"."kode_kabkot"
WHERE "tb_kec"."id" = '862'

        $kec2 = $query2->getResultArray();
        // dd($kec2);

        $kec = $this->GambKecModel->findAll();
---
SELECT *
FROM "tb_kec"